app/controllers/admins_controller.rb

  def index
    @book = Book.all
---
SELECT "books".* FROM "books"

  def show
    # user_id = current_user[:id]
    id = params[:id]
    @book = Book.where(is_rental: true, rental_id: id)
---
SELECT "books".* FROM "books" WHERE "books"."is_rental" = $1 LIMIT $2  [["is_rental", true], ["LIMIT", 1]]