app/controllers/books_controller.rb

  def index
    @book = Book.all
    @current_user_id = User.find(params[:user_id])
---
SELECT "books".* FROM "books"
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", "511a6a54-d1bd-4e45-89ae-f1035e5e36b0"], ["LIMIT", 1]]

  def show
    id = params[:id]
    @book = Book.find(id)
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", "0d013ee4-6141-4a10-b988-ccfedb97946f"], ["LIMIT", 1]]

  def create
    @book = user.books.build(book_params)
    if @book.save
---
INSERT INTO "books" ("name", "author_name", "description", "gender", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def edit
    @book = Book.find(params[:id])
    @user = User.find(params[:user_id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", "0d013ee4-6141-4a10-b988-ccfedb97946f"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", "511a6a54-d1bd-4e45-89ae-f1035e5e36b0"], ["LIMIT", 1]]

  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", "2a1eb56e-e7c3-412f-8100-f738c5413325"], ["LIMIT", 1]]
UPDATE "books" SET "gender" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["gender", "l1453"], ["updated_at", "2021-11-09 16:14:54.005107"], ["id", "2a1eb56e-e7c3-412f-8100-f738c5413325"]]

  def destroy
    id = params[:id]
    book = Book.find(id)
    book.destroy
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", "0d013ee4-6141-4a10-b988-ccfedb97946f"], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = $1  [["id", "0d013ee4-6141-4a10-b988-ccfedb97946f"]]

  def user
    @user ||= User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", "511a6a54-d1bd-4e45-89ae-f1035e5e36b0"], ["LIMIT", 1]]