app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "soreljulienn@gmail.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "nana@example.com"], ["LIMIT", 1]]
---
  def create
    email = params[:email]
    password = params[:password]
    user_find = User.find_by(email: email)
    user = User.find_by(email: email)&.authenticate(password)