app/controllers/users_controller.rb

  def index
    @book = Book.is_not_rental
    @current_user = User.find(current_user['id'])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "phone", "city", "town", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def rentbook
      @book = Book.find(params[:book])
      @book.update(is_rental: true, rental_id: params[:user])
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", "42f99564-d8d3-4000-b839-073e412e56c6"], ["LIMIT", 1]]
UPDATE "books" SET "is_rental" = $1, "rental_id" = $2, "updated_at" = $3 WHERE "books"."id" = $4  [["is_rental", true], ["rental_id", "fac238f0-8dc1-48cd-ac30-249c21295264"], ["updated_at", "2021-11-09 18:37:26.937533"], ["id", "dced22b3-e32d-4827-9d0e-15fadd6d6203"]]

  def destroy
    id = params[:id]
    user = User.find(id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", "511a6a54-d1bd-4e45-89ae-f1035e5e36b0"], ["LIMIT", 1]]